### 1. 데이터셋  영화 타이틀 데이터 셋. 
      -. moves_title.csv

In [1]:
import pandas as pd

### 2. titles의 Data Frame을 만든다.

In [2]:
titles = pd.read_csv("c:/aaa/movies_title.csv")
titles

                          title  year
0                The Rising Son  1990
1             Ashes of Kukulcan  2016
2       The Thousand Plane Raid  1969
3              Crucea de piatra  1993
4                        The 86  2015
...                         ...   ...
215976           Le mouton noir  1922
215977      Edge of the Unknown  2015
215978                    E yue  2005
215979             Lakota Girls  2015
215980             The Sting II  1983

[215981 rows x 2 columns]

### 3. df 필수 명령 8가지 실행

In [3]:
# 데이터 조회
titles.head()

                     title  year
0           The Rising Son  1990
1        Ashes of Kukulcan  2016
2  The Thousand Plane Raid  1969
3         Crucea de piatra  1993
4                   The 86  2015

In [4]:
# df정보..건수, 컬럼수
titles.shape

(215981, 2)

In [5]:
# 컬럼이름
titles.columns

Index(['title', 'year'], dtype='object')

In [6]:
# 데이터 프레임 구조
titles.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 215981 entries, 0 to 215980
Data columns (total 2 columns):
 #   Column  Non-Null Count   Dtype
---  ------  --------------   -----
 0   title   215981 non-null  object
 1   year    215981 non-null  int64
dtypes: int64(1), object(1)
memory usage: 3.3+ MB

In [7]:
# 마지막 데이터
titles.tail()

                      title  year
215976       Le mouton noir  1922
215977  Edge of the Unknown  2015
215978                E yue  2005
215979         Lakota Girls  2015
215980         The Sting II  1983

In [8]:
# 결측치 확인 
titles.isnull()

        title   year
0       False  False
1       False  False
2       False  False
3       False  False
4       False  False
...       ...    ...
215976  False  False
215977  False  False
215978  False  False
215979  False  False
215980  False  False

[215981 rows x 2 columns]

In [9]:
titles.isnull().sum()

title    0
year     0
dtype: int64

In [10]:
# 요약 통계량
titles.describe()

                year
count  215981.000000
mean     1984.553822
std        29.343957
min      1894.000000
25%      1965.000000
50%      1994.000000
75%      2010.000000
max      2024.000000

In [11]:
# 측정 컬럼(변수)
titles["year"].value_counts().sort_values(ascending=False)

2015    13978
2014     8209
2013     7664
2012     7273
2011     6844
        ...
2024        2
1905        2
1903        1
1897        1
1894        1
Name: year, Length: 124, dtype: int64

In [12]:
titles["title"].value_counts().sort_values(ascending=False)

Hamlet                            19
Macbeth                           14
Carmen                            14
The Three Musketeers              12
She                               11
                                  ..
Deadly Obsessions                  1
One Mile from Heaven               1
Los aparecidos                     1
Creatures from the Pink Lagoon     1
Harot                              1
Name: title, Length: 197575, dtype: int64

### 4. 전체 영화는 몇개인가?

In [13]:
titles.count()

title    215981
year     215981
dtype: int64

In [14]:
count=titles["title"]
count

0                  The Rising Son
1               Ashes of Kukulcan
2         The Thousand Plane Raid
3                Crucea de piatra
4                          The 86
                   ...
215976             Le mouton noir
215977        Edge of the Unknown
215978                      E yue
215979               Lakota Girls
215980               The Sting II
Name: title, Length: 215981, dtype: object

In [15]:
print("전체 영화는",len(count),"개 입니다.")

전체 영화는 215981 개 입니다.

### 5. 가장 빠른 시기에 제작된 영화 2개를 찾아라.

In [16]:
titles.sort_values(by=['year'])[:2]

                                                    title  year
165182                                         Miss Jerry  1894
85708   Reproduction of the Corbett and Fitzsimmons Fight  1897

### 6. 제목이 "Hamlet"인 영화는 몇개인가?

In [17]:
Hamlet=titles[titles['title']=='Hamlet']
Hamlet

         title  year
5562    Hamlet  1948
26160   Hamlet  2016
37373   Hamlet  2015
42224   Hamlet  1990
43511   Hamlet  1910
68239   Hamlet  1954
85741   Hamlet  1976
87781   Hamlet  1987
87971   Hamlet  2000
91710   Hamlet  1921
114224  Hamlet  1969
154627  Hamlet  1913
163645  Hamlet  2009
169996  Hamlet  1964
186988  Hamlet  1996
192815  Hamlet  2011
195015  Hamlet  1911
205821  Hamlet  1973
207793  Hamlet  2014

In [18]:
print("제목이 'Hamlet'인 영화는",len(Hamlet),"개 입니다.")

제목이 'Hamlet'인 영화는 19 개 입니다.

### 7. 제목이 "Treasure Island"는 몇개인가? 제작년도 오름차순으로 나열

In [19]:
Treasure_Island=titles[titles['title']=='Treasure Island']
Treasure_Island.sort_values(by=['year'])

                  title  year
191379  Treasure Island  1918
47769   Treasure Island  1920
192917  Treasure Island  1934
90175   Treasure Island  1950
104714  Treasure Island  1972
103646  Treasure Island  1973
190792  Treasure Island  1985
166675  Treasure Island  1999

In [20]:
print("제목이 'Treasure Island'인 영화는",len(Treasure_Island),"개 입니다.")

제목이 'Treasure Island'인 영화는 8 개 입니다.

### 8. 1950년에서 1959년사이에 만들어진 영화는 몇개인가?

In [21]:
movie_y=titles.sort_values(by=['year'])
movie_y

                                                    title  year
165182                                         Miss Jerry  1894
85708   Reproduction of the Corbett and Fitzsimmons Fight  1897
115903     Reproduction of the Corbett and Jeffries Fight  1899
198354        Sharkey-McCoy Fight Reproduced in 10 Rounds  1899
12582                                Family Troubles (II)  1900
...                                                   ...   ...
26537                                   Spider in the Web  2022
185368                                  The Tree of Death  2022
40476                                               Rosie  2022
199790                                     New in Village  2024
44198                                           Wild Runs  2024

[215981 rows x 2 columns]

In [22]:
time = movie_y.loc[(titles['year'] >= 1950) & (titles['year'] <= 1959)]
time

                                                    title  year
155736  A Ray of Sunshine: An Irresponsible Medley of ...  1950
57582                                  Min syster och jag  1950
35292                         Kees de zoon van de stroper  1950
156704                                Across the Badlands  1950
125696                                    La familia Vila  1950
...                                                   ...   ...
54006                                       Le petit prof  1959
77198                                            Maria 38  1959
7396                                  Witness in the Dark  1959
193215                               The Flying Fontaines  1959
78240                                        Les 90 Jours  1959

[12120 rows x 2 columns]

In [23]:
print("1950년에서 1959년사이에 만들어진 영화는",len(time),"개 입니다.")

1950년에서 1959년사이에 만들어진 영화는 12120 개 입니다.